/*
* На занятии 13 мы научились:
* - Создавать элементы
* - Находить элементы
* - Изменять свойство элементов
* - Читать свойства элементов
*/

/*
* События - это реакция браузера на какое-то действие пользователя. Сегодня мы научимся реагировать на действия пользователя
* Действие пользователя может быть - нажатие клавиши скрол мышки
* Пользователь кликнул а браузер сгенерил событиу создал это событие и отправил нам
* Мы как разработчики можем поймать это событие и как-то на него отреагировать (выполнить какой-то код)
*/

/*
* События
* - Создание и удаление слушателей
* - Именование колбеков для слушателей
* - handle*: handleEvent или handleSubjectEvent
* - Handler: eventHandler или subjectEventHandler
* - on*: onEvent или onSubjectEvent
* - ссылочная идентичность колбеков
* - Обьяект события
*/

